#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_subnet.public-subnet[3]: Refreshing state... [id=subnet-0802346d4b981dfed]
aws_subnet.public-subnet[5]: Refreshing state... [id=subnet-06d3438a83b61e94a]
data.aws_availability_zones.all: Reading...
aws_subnet.private-subnet[5]: Refreshing state... [id=subnet-0501c52a1f289c110]
aws_subnet.private-subnet[0]: Refreshing state... [id=subnet-00dcbb0b46335b77d]
aws_subnet.public-subnet[0]: Refreshing state... [id=subnet-0a646ea5ca9772bf1]
aws_subnet.private-subnet[2]: Refreshing state... [id=subnet-076088399c74da47c]
aws_subnet.public-subnet[4]: Refreshing state... [id=subnet-0822744c3a82c39ae]
aws_subnet.private-subnet[4]: Refreshing state... [id=subnet-06af18783170172a1]
aws_subnet.public-subnet[1]: Refreshing state... [id=subnet-05fba7f37355b37ce]
data.aws_availability_zones.all: Read complete after 0s [id=us-east-1]
aws_subnet.private-subnet[3]: Refreshing state... [id=subnet-0c03850cbfc171e7c]
aws_subnet.private-subnet[1]: Refreshing state... [id=subnet-023b1334c9bf71f6b]
aws_subnet.public-subnet[2]: Refreshing state... [id=subnet-029ef908c045c64bc]
aws_ssm_parameter.foo: Refreshing state... [id=foo]
aws_vpc.main: Refreshing state... [id=vpc-0019a2de5322a3397]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "Production"
          + "Name"        = "main-internet-gateway"
          + "Owner"       = "Shubham"
        }
      + tags_all = {
          + "Environment" = "Production"
          + "Name"        = "main-internet-gateway"
          + "Owner"       = "Shubham"
        }
      + vpc_id   = "vpc-0019a2de5322a3397"
    }

  # aws_route.public_subnets_igw[0] will be created
  + resource "aws_route" "public_subnets_igw" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-03433f2e9d1e10e7c"
      + state                  = (known after apply)
    }

  # aws_route.public_subnets_igw[1] will be created
  + resource "aws_route" "public_subnets_igw" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-03433f2e9d1e10e7c"
      + state                  = (known after apply)
    }

  # aws_route.public_subnets_igw[2] will be created
  + resource "aws_route" "public_subnets_igw" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-03433f2e9d1e10e7c"
      + state                  = (known after apply)
    }

  # aws_route.public_subnets_igw[3] will be created
  + resource "aws_route" "public_subnets_igw" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-03433f2e9d1e10e7c"
      + state                  = (known after apply)
    }

  # aws_route.public_subnets_igw[4] will be created
  + resource "aws_route" "public_subnets_igw" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-03433f2e9d1e10e7c"
      + state                  = (known after apply)
    }

  # aws_route.public_subnets_igw[5] will be created
  + resource "aws_route" "public_subnets_igw" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-03433f2e9d1e10e7c"
      + state                  = (known after apply)
    }

  # aws_route_table_association.public_subnets_association[0] will be created
  + resource "aws_route_table_association" "public_subnets_association" {
      + id             = (known after apply)
      + route_table_id = "rtb-03433f2e9d1e10e7c"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_subnets_association[1] will be created
  + resource "aws_route_table_association" "public_subnets_association" {
      + id             = (known after apply)
      + route_table_id = "rtb-03433f2e9d1e10e7c"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_subnets_association[2] will be created
  + resource "aws_route_table_association" "public_subnets_association" {
      + id             = (known after apply)
      + route_table_id = "rtb-03433f2e9d1e10e7c"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_subnets_association[3] will be created
  + resource "aws_route_table_association" "public_subnets_association" {
      + id             = (known after apply)
      + route_table_id = "rtb-03433f2e9d1e10e7c"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_subnets_association[4] will be created
  + resource "aws_route_table_association" "public_subnets_association" {
      + id             = (known after apply)
      + route_table_id = "rtb-03433f2e9d1e10e7c"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_subnets_association[5] will be created
  + resource "aws_route_table_association" "public_subnets_association" {
      + id             = (known after apply)
      + route_table_id = "rtb-03433f2e9d1e10e7c"
      + subnet_id      = (known after apply)
    }

  # aws_subnet.private-subnet[0] will be destroyed
  # (because aws_subnet.private-subnet is not in configuration)
  - resource "aws_subnet" "private-subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-00dcbb0b46335b77d" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.0.101.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-00dcbb0b46335b77d" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "private-subnet-az-1"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "private-subnet-az-1"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.private-subnet[1] will be destroyed
  # (because aws_subnet.private-subnet is not in configuration)
  - resource "aws_subnet" "private-subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-023b1334c9bf71f6b" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.0.102.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-023b1334c9bf71f6b" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "private-subnet-az-2"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "private-subnet-az-2"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.private-subnet[2] will be destroyed
  # (because aws_subnet.private-subnet is not in configuration)
  - resource "aws_subnet" "private-subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-076088399c74da47c" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1c" -> null
      - availability_zone_id                           = "use1-az4" -> null
      - cidr_block                                     = "10.0.103.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-076088399c74da47c" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "private-subnet-az-3"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "private-subnet-az-3"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.private-subnet[3] will be destroyed
  # (because aws_subnet.private-subnet is not in configuration)
  - resource "aws_subnet" "private-subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-0c03850cbfc171e7c" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1d" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "10.0.104.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0c03850cbfc171e7c" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "private-subnet-az-4"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "private-subnet-az-4"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.private-subnet[4] will be destroyed
  # (because aws_subnet.private-subnet is not in configuration)
  - resource "aws_subnet" "private-subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-06af18783170172a1" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1e" -> null
      - availability_zone_id                           = "use1-az3" -> null
      - cidr_block                                     = "10.0.105.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-06af18783170172a1" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "private-subnet-az-5"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "private-subnet-az-5"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.private-subnet[5] will be destroyed
  # (because aws_subnet.private-subnet is not in configuration)
  - resource "aws_subnet" "private-subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-0501c52a1f289c110" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1f" -> null
      - availability_zone_id                           = "use1-az5" -> null
      - cidr_block                                     = "10.0.106.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0501c52a1f289c110" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "private-subnet-az-6"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "private-subnet-az-6"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.private_subnet[0] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-1"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-1"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.private_subnet[1] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-2"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-2"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.private_subnet[2] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-3"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-3"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.private_subnet[3] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.104.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-4"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-4"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.private_subnet[4] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1e"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.105.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-5"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-5"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.private_subnet[5] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1f"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.106.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-6"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-az-6"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.public-subnet[0] will be destroyed
  # (because aws_subnet.public-subnet is not in configuration)
  - resource "aws_subnet" "public-subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-0a646ea5ca9772bf1" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0a646ea5ca9772bf1" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-1"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-1"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.public-subnet[1] will be destroyed
  # (because aws_subnet.public-subnet is not in configuration)
  - resource "aws_subnet" "public-subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-05fba7f37355b37ce" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.0.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-05fba7f37355b37ce" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-2"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-2"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.public-subnet[2] will be destroyed
  # (because aws_subnet.public-subnet is not in configuration)
  - resource "aws_subnet" "public-subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-029ef908c045c64bc" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1c" -> null
      - availability_zone_id                           = "use1-az4" -> null
      - cidr_block                                     = "10.0.3.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-029ef908c045c64bc" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-3"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-3"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.public-subnet[3] will be destroyed
  # (because aws_subnet.public-subnet is not in configuration)
  - resource "aws_subnet" "public-subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-0802346d4b981dfed" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1d" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "10.0.4.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0802346d4b981dfed" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-4"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-4"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.public-subnet[4] will be destroyed
  # (because aws_subnet.public-subnet is not in configuration)
  - resource "aws_subnet" "public-subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-0822744c3a82c39ae" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1e" -> null
      - availability_zone_id                           = "use1-az3" -> null
      - cidr_block                                     = "10.0.5.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0822744c3a82c39ae" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-5"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-5"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.public-subnet[5] will be destroyed
  # (because aws_subnet.public-subnet is not in configuration)
  - resource "aws_subnet" "public-subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:619568494776:subnet/subnet-06d3438a83b61e94a" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1f" -> null
      - availability_zone_id                           = "use1-az5" -> null
      - cidr_block                                     = "10.0.6.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-06d3438a83b61e94a" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "619568494776" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-6"
          - "Owner"       = "Shubham"
        } -> null
      - tags_all                                       = {
          - "Environment" = "Production"
          - "Name"        = "public-subnet-az-6"
          - "Owner"       = "Shubham"
        } -> null
      - vpc_id                                         = "vpc-0019a2de5322a3397" -> null
    }

  # aws_subnet.public_subnet[0] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-1"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-1"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.public_subnet[1] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-2"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-2"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.public_subnet[2] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-3"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-3"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.public_subnet[3] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-4"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-4"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.public_subnet[4] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1e"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-5"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-5"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.public_subnet[5] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1f"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-6"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-az-6"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

Plan: 25 to add, 0 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @shubhamcommits, Action: `pull_request`*